The [patch](https://github.com/DataBiosphere/azul/pull/5602#issuecomment-1758419532) did not work.

From https://docs.aws.amazon.com/AmazonCloudWatch/latest/monitoring/CloudWatch-Agent-Configuration-File-Details.html#CloudWatch-Agent-Configuration-File-Metricssection
> The only supported key-value pairs for `append_dimensions` are shown in the following list. Any other key-value pairs are ignored.

however:
> If you want to append dimensions to metrics with arbitrary key-value pairs, use the append_dimensions parameter in the field for that particular type of metric.

This approach was attempted, however the metrics produced still included the `InstanceID`:

![Screen Shot 2023-10-11 at 10 01 17 PM](https://github.com/DataBiosphere/azul/assets/46407464/c401a254-1ce8-417e-90f1-2ce1ba2dec63)

After some more research & tinkering, I found we could use `aggregation_dimensions` to specify a dimension

> `aggregation_dimensions` – Optional. Specifies the dimensions that collected metrics are to be aggregated on. For example, if you roll up metrics on the `AutoScalingGroupName` dimension, the metrics from all instances in each Auto Scaling group are aggregated and can be viewed as a whole.

This approach (the current version of this PR) appears to have given us the desired results. Evidence from testing this follows:

<details>
<summary>Expand for: Terraform plan when deploying PR branch (with `aggregation_dimensions`)</summary>

```
Terraform will perform the following actions:

  # aws_cloudwatch_metric_alarm.gitlab_cpu_use will be updated in-place
  ~ resource "aws_cloudwatch_metric_alarm" "gitlab_cpu_use" {
      ~ dimensions                = {
          - "InstanceId"   = "i-0814c6ee969eee651" -> null
          + "InstanceName" = "azul-gitlab"
          - "cpu"          = "cpu-total" -> null
        }
        id                        = "azul-gitlab_cpu_use"
        tags                      = {
            "Name"                = "azul-gitlab_cpu_use"
            "billing"             = "hca"
            "component"           = "azul-gitlab_cpu_use"
            "deployment"          = "dev"
            "owner"               = "hannes@ucsc.edu"
            "service"             = "azul"
            "terraform_component" = "gitlab"
        }
        # (16 unchanged attributes hidden)
    }

  # aws_cloudwatch_metric_alarm.gitlab_data_disk_use will be updated in-place
  ~ resource "aws_cloudwatch_metric_alarm" "gitlab_data_disk_use" {
      ~ dimensions                = {
          - "InstanceId"   = "i-0814c6ee969eee651" -> null
          + "InstanceName" = "azul-gitlab"
          - "fstype"       = "ext4" -> null
          - "path"         = "/mnt/gitlab" -> null
        }
        id                        = "azul-gitlab_data_disk_use"
        tags                      = {
            "Name"                = "azul-gitlab_data_disk_use"
            "billing"             = "hca"
            "component"           = "azul-gitlab_data_disk_use"
            "deployment"          = "dev"
            "owner"               = "hannes@ucsc.edu"
            "service"             = "azul"
            "terraform_component" = "gitlab"
        }
        # (16 unchanged attributes hidden)
    }

  # aws_cloudwatch_metric_alarm.gitlab_root_disk_use will be updated in-place
  ~ resource "aws_cloudwatch_metric_alarm" "gitlab_root_disk_use" {
      ~ dimensions                = {
          - "InstanceId"   = "i-0814c6ee969eee651" -> null
          + "InstanceName" = "azul-gitlab"
          - "fstype"       = "xfs" -> null
          - "path"         = "/" -> null
        }
        id                        = "azul-gitlab_root_disk_use"
        tags                      = {
            "Name"                = "azul-gitlab_root_disk_use"
            "billing"             = "hca"
            "component"           = "azul-gitlab_root_disk_use"
            "deployment"          = "dev"
            "owner"               = "hannes@ucsc.edu"
            "service"             = "azul"
            "terraform_component" = "gitlab"
        }
        # (16 unchanged attributes hidden)
    }

  # aws_instance.gitlab must be replaced
-/+ resource "aws_instance" "gitlab" {
      ~ arn                                  = "arn:aws:ec2:us-east-1:122796619775:instance/i-0814c6ee969eee651" -> (known after apply)
      ~ associate_public_ip_address          = false -> (known after apply)
      ~ availability_zone                    = "us-east-1a" -> (known after apply)
      ~ cpu_core_count                       = 2 -> (known after apply)
      ~ cpu_threads_per_core                 = 2 -> (known after apply)
      ~ disable_api_stop                     = false -> (known after apply)
      ~ disable_api_termination              = false -> (known after apply)
      ~ ebs_optimized                        = false -> (known after apply)
      - hibernation                          = false -> null
      + host_id                              = (known after apply)
      + host_resource_group_arn              = (known after apply)
      ~ id                                   = "i-0814c6ee969eee651" -> (known after apply)
      ~ instance_initiated_shutdown_behavior = "stop" -> (known after apply)
      ~ instance_state                       = "running" -> (known after apply)
      ~ ipv6_address_count                   = 0 -> (known after apply)
      ~ ipv6_addresses                       = [] -> (known after apply)
      ~ monitoring                           = false -> (known after apply)
      + outpost_arn                          = (known after apply)
      + password_data                        = (known after apply)
      + placement_group                      = (known after apply)
      ~ placement_partition_number           = 0 -> (known after apply)
      ~ primary_network_interface_id         = "eni-0c846b93480f23459" -> (known after apply)
      ~ private_dns                          = "ip-172-71-0-215.ec2.internal" -> (known after apply)
      ~ private_ip                           = "172.71.0.215" -> (known after apply)
      + public_dns                           = (known after apply)
      + public_ip                            = (known after apply)
      ~ secondary_private_ips                = [] -> (known after apply)
      ~ security_groups                      = [] -> (known after apply)
      - source_dest_check                    = true -> null
      ~ subnet_id                            = "subnet-090846270b8070f28" -> (known after apply)
        tags                                 = {
            "Name"                = "azul-gitlab"
            "Owner"               = "hannes@ucsc.edu"
            "billing"             = "hca"
            "component"           = "azul-gitlab"
            "deployment"          = "dev"
            "owner"               = "hannes@ucsc.edu"
            "service"             = "azul"
            "terraform_component" = "gitlab"
        }
      ~ tenancy                              = "default" -> (known after apply)
      ~ user_data                            = "12e76cce0f177d99b425936aff81bd1ac6113158" -> "3b722a2bb45e865ea48b337f77f6310ace6b1ab4" # forces replacement
      + user_data_base64                     = (known after apply)
      ~ vpc_security_group_ids               = [
          - "sg-038ac968511f754f0",
        ] -> (known after apply)
        # (7 unchanged attributes hidden)

      ~ capacity_reservation_specification {
          ~ capacity_reservation_preference = "open" -> (known after apply)

          + capacity_reservation_target {
              + capacity_reservation_id                 = (known after apply)
              + capacity_reservation_resource_group_arn = (known after apply)
            }
        }

      - credit_specification {
          - cpu_credits = "unlimited" -> null
        }

      + ebs_block_device {
          + delete_on_termination = (known after apply)
          + device_name           = (known after apply)
          + encrypted             = (known after apply)
          + iops                  = (known after apply)
          + kms_key_id            = (known after apply)
          + snapshot_id           = (known after apply)
          + tags                  = (known after apply)
          + throughput            = (known after apply)
          + volume_id             = (known after apply)
          + volume_size           = (known after apply)
          + volume_type           = (known after apply)
        }
      - ebs_block_device {
          - delete_on_termination = false -> null
          - device_name           = "/dev/sdf" -> null
          - encrypted             = true -> null
          - iops                  = 600 -> null
          - kms_key_id            = "arn:aws:kms:us-east-1:122796619775:key/b43df053-3aff-49a7-8060-589985026613" -> null
          - snapshot_id           = "snap-00fffed9c165f6b37" -> null
          - tags                  = {
              - "Name"  = "azul-gitlab"
              - "owner" = "hannes@ucsc.edu"
            } -> null
          - throughput            = 0 -> null
          - volume_id             = "vol-0857f94c30caed5c2" -> null
          - volume_size           = 200 -> null
          - volume_type           = "gp2" -> null
        }

      ~ enclave_options {
          ~ enabled = false -> (known after apply)
        }

      + ephemeral_block_device {
          + device_name  = (known after apply)
          + no_device    = (known after apply)
          + virtual_name = (known after apply)
        }

      ~ maintenance_options {
          ~ auto_recovery = "default" -> (known after apply)
        }

      ~ metadata_options {
          ~ instance_metadata_tags      = "disabled" -> (known after apply)
            # (3 unchanged attributes hidden)
        }

      ~ private_dns_name_options {
          + enable_resource_name_dns_a_record    = (known after apply)
          + enable_resource_name_dns_aaaa_record = (known after apply)
          + hostname_type                        = (known after apply)
        }

      ~ root_block_device {
          ~ device_name           = "/dev/xvda" -> (known after apply)
          ~ iops                  = 100 -> (known after apply)
          ~ kms_key_id            = "arn:aws:kms:us-east-1:122796619775:key/b43df053-3aff-49a7-8060-589985026613" -> (known after apply)
          - tags                  = {} -> null
          ~ throughput            = 0 -> (known after apply)
          ~ volume_id             = "vol-01f0ed4f404ce7706" -> (known after apply)
          ~ volume_type           = "gp2" -> (known after apply)
            # (3 unchanged attributes hidden)
        }

        # (1 unchanged block hidden)
    }

  # aws_lb_target_group_attachment.gitlab_git must be replaced
-/+ resource "aws_lb_target_group_attachment" "gitlab_git" {
      ~ id               = "arn:aws:elasticloadbalancing:us-east-1:122796619775:targetgroup/azul-gitlab-git/8b5c80fd833b73a2-20231012053955783700000003" -> (known after apply)
      ~ target_id        = "i-0814c6ee969eee651" -> (known after apply) # forces replacement
        # (1 unchanged attribute hidden)
    }

  # aws_lb_target_group_attachment.gitlab_http must be replaced
-/+ resource "aws_lb_target_group_attachment" "gitlab_http" {
      ~ id               = "arn:aws:elasticloadbalancing:us-east-1:122796619775:targetgroup/azul-gitlab-http/136c2d6db59941f6-20231012053955637800000002" -> (known after apply)
      ~ target_id        = "i-0814c6ee969eee651" -> (known after apply) # forces replacement
        # (1 unchanged attribute hidden)
    }

  # aws_lb_target_group_attachment.gitlab_ssh must be replaced
-/+ resource "aws_lb_target_group_attachment" "gitlab_ssh" {
      ~ id               = "arn:aws:elasticloadbalancing:us-east-1:122796619775:targetgroup/azul-gitlab-ssh/8826fb86763d46a7-20231012053955869500000004" -> (known after apply)
      ~ target_id        = "i-0814c6ee969eee651" -> (known after apply) # forces replacement
        # (1 unchanged attribute hidden)
    }

  # aws_volume_attachment.gitlab must be replaced
-/+ resource "aws_volume_attachment" "gitlab" {
      ~ id          = "vai-3770483065" -> (known after apply)
      ~ instance_id = "i-0814c6ee969eee651" -> (known after apply) # forces replacement
        # (2 unchanged attributes hidden)
    }

Plan: 5 to add, 3 to change, 5 to destroy.

Do you want to perform these actions?
  Terraform will perform the actions described above.
  Only 'yes' will be accepted to approve.

  Enter a value: yes

aws_lb_target_group_attachment.gitlab_http: Destroying... [id=arn:aws:elasticloadbalancing:us-east-1:122796619775:targetgroup/azul-gitlab-http/136c2d6db59941f6-20231012053955637800000002]
aws_lb_target_group_attachment.gitlab_git: Destroying... [id=arn:aws:elasticloadbalancing:us-east-1:122796619775:targetgroup/azul-gitlab-git/8b5c80fd833b73a2-20231012053955783700000003]
aws_lb_target_group_attachment.gitlab_ssh: Destroying... [id=arn:aws:elasticloadbalancing:us-east-1:122796619775:targetgroup/azul-gitlab-ssh/8826fb86763d46a7-20231012053955869500000004]
aws_volume_attachment.gitlab: Destroying... [id=vai-3770483065]
aws_volume_attachment.gitlab: Provisioning with 'local-exec'...
aws_volume_attachment.gitlab (local-exec): Executing: ["/bin/sh" "-c" "aws ec2 stop-instances --instance-ids i-0814c6ee969eee651 && aws ec2 wait instance-stopped --instance-ids i-0814c6ee969eee651"]
aws_lb_target_group_attachment.gitlab_http: Destruction complete after 0s
aws_lb_target_group_attachment.gitlab_ssh: Destruction complete after 0s
aws_lb_target_group_attachment.gitlab_git: Destruction complete after 0s
aws_volume_attachment.gitlab (local-exec): {
aws_volume_attachment.gitlab (local-exec):     "StoppingInstances": [
aws_volume_attachment.gitlab (local-exec):         {
aws_volume_attachment.gitlab (local-exec):             "CurrentState": {
aws_volume_attachment.gitlab (local-exec):                 "Code": 64,
aws_volume_attachment.gitlab (local-exec):                 "Name": "stopping"
aws_volume_attachment.gitlab (local-exec):             },
aws_volume_attachment.gitlab (local-exec):             "InstanceId": "i-0814c6ee969eee651",
aws_volume_attachment.gitlab (local-exec):             "PreviousState": {
aws_volume_attachment.gitlab (local-exec):                 "Code": 16,
aws_volume_attachment.gitlab (local-exec):                 "Name": "running"
aws_volume_attachment.gitlab (local-exec):             }
aws_volume_attachment.gitlab (local-exec):         }
aws_volume_attachment.gitlab (local-exec):     ]
aws_volume_attachment.gitlab (local-exec): }
aws_volume_attachment.gitlab: Still destroying... [id=vai-3770483065, 10s elapsed]
aws_volume_attachment.gitlab: Still destroying... [id=vai-3770483065, 20s elapsed]
aws_volume_attachment.gitlab: Still destroying... [id=vai-3770483065, 30s elapsed]
aws_volume_attachment.gitlab: Still destroying... [id=vai-3770483065, 40s elapsed]
aws_volume_attachment.gitlab: Still destroying... [id=vai-3770483065, 50s elapsed]
aws_volume_attachment.gitlab: Still destroying... [id=vai-3770483065, 1m0s elapsed]
aws_volume_attachment.gitlab: Still destroying... [id=vai-3770483065, 1m10s elapsed]
aws_volume_attachment.gitlab: Still destroying... [id=vai-3770483065, 1m20s elapsed]
aws_volume_attachment.gitlab: Destruction complete after 1m30s
aws_instance.gitlab: Destroying... [id=i-0814c6ee969eee651]
aws_instance.gitlab: Still destroying... [id=i-0814c6ee969eee651, 10s elapsed]
aws_instance.gitlab: Destruction complete after 10s
aws_cloudwatch_metric_alarm.gitlab_root_disk_use: Modifying... [id=azul-gitlab_root_disk_use]
aws_cloudwatch_metric_alarm.gitlab_cpu_use: Modifying... [id=azul-gitlab_cpu_use]
aws_cloudwatch_metric_alarm.gitlab_data_disk_use: Modifying... [id=azul-gitlab_data_disk_use]
aws_instance.gitlab: Creating...
aws_cloudwatch_metric_alarm.gitlab_data_disk_use: Modifications complete after 1s [id=azul-gitlab_data_disk_use]
aws_cloudwatch_metric_alarm.gitlab_cpu_use: Modifications complete after 1s [id=azul-gitlab_cpu_use]
aws_cloudwatch_metric_alarm.gitlab_root_disk_use: Modifications complete after 1s [id=azul-gitlab_root_disk_use]
aws_instance.gitlab: Still creating... [10s elapsed]
aws_instance.gitlab: Creation complete after 15s [id=i-0ac85c41edd97978f]
aws_volume_attachment.gitlab: Creating...
aws_lb_target_group_attachment.gitlab_ssh: Creating...
aws_lb_target_group_attachment.gitlab_http: Creating...
aws_lb_target_group_attachment.gitlab_git: Creating...
aws_lb_target_group_attachment.gitlab_http: Creation complete after 0s [id=arn:aws:elasticloadbalancing:us-east-1:122796619775:targetgroup/azul-gitlab-http/136c2d6db59941f6-20231012062829452700000002]
aws_lb_target_group_attachment.gitlab_ssh: Creation complete after 1s [id=arn:aws:elasticloadbalancing:us-east-1:122796619775:targetgroup/azul-gitlab-ssh/8826fb86763d46a7-20231012062829693300000003]
aws_lb_target_group_attachment.gitlab_git: Creation complete after 1s [id=arn:aws:elasticloadbalancing:us-east-1:122796619775:targetgroup/azul-gitlab-git/8b5c80fd833b73a2-20231012062829931500000004]
aws_volume_attachment.gitlab: Still creating... [10s elapsed]
aws_volume_attachment.gitlab: Still creating... [20s elapsed]
aws_volume_attachment.gitlab: Creation complete after 21s [id=vai-3229068279]

Apply complete! Resources: 5 added, 3 changed, 5 destroyed.
```
</details>


# Metrics after current version of PR deployed

(Note: Unfortunately, metrics previously created such as `InstanceId, InstanceName` from my early testing will be present for 2 weeks until they expire from the history)

![Screen Shot 2023-10-11 at 11 47 21 PM](https://github.com/DataBiosphere/azul/assets/46407464/9010bb76-0dda-4f79-891f-8baf90aeae7b)

![Screen Shot 2023-10-11 at 11 47 49 PM](https://github.com/DataBiosphere/azul/assets/46407464/05ecb67c-e4b0-490a-acf8-8cf01bb5ef72)

# Alarm configuration after PR deployed

![Screen Shot 2023-10-11 at 11 49 06 PM](https://github.com/DataBiosphere/azul/assets/46407464/2a70c027-6e43-41e1-b651-97477b0678aa)

![Screen Shot 2023-10-11 at 11 50 43 PM](https://github.com/DataBiosphere/azul/assets/46407464/18c23f9c-cc38-404c-b824-b7a2810c72f8)

<details>
<summary>Expand for: Log when tainting resource & deploying gitlab</summary>

```
(.venv) daniel@Crispin ~/repo/azul1 $
(.venv) daniel@Crispin ~/repo/azul1 $ cd terraform/gitlab/
(.venv) daniel@Crispin ~/repo/azul1/terraform/gitlab $ terraform taint aws_instance.gitlab
Resource instance aws_instance.gitlab has been marked as tainted.
(.venv) daniel@Crispin ~/repo/azul1/terraform/gitlab $
(.venv) daniel@Crispin ~/repo/azul1/terraform/gitlab $ cd ../..
(.venv) daniel@Crispin ~/repo/azul1 $
(.venv) daniel@Crispin ~/repo/azul1 $ CI_COMMIT_REF_NAME=develop make -C terraform/gitlab
python /Users/daniel/repo/azul1/scripts/check_branch.py
python providers.tf.json.template.py providers.tf.json
Creating providers.tf.json
python backend.tf.json.template.py backend.tf.json
Creating backend.tf.json
terraform init -reconfigure

Initializing the backend...

Successfully configured the backend "s3"! Terraform will automatically
use this backend unless the backend configuration changes.

Initializing provider plugins...
- Reusing previous version of hashicorp/google from the dependency lock file
- Reusing previous version of hashicorp/aws from the dependency lock file
- Reusing previous version of hashicorp/external from the dependency lock file
- Reusing previous version of hashicorp/null from the dependency lock file
- Using previously-installed hashicorp/null v3.2.0
- Using previously-installed hashicorp/google v4.58.0
- Using previously-installed hashicorp/aws v4.58.0
- Using previously-installed hashicorp/external v2.2.0

Terraform has been successfully initialized!

You may now begin working with Terraform. Try running "terraform plan" to see
any changes that are required for your infrastructure. All Terraform commands
should now work.

If you ever set or change modules or backend configuration for Terraform,
rerun this command to reinitialize your working directory. If you forget, other
commands will detect it and remind you to do so if necessary.
python common.tf.json.template.py common.tf.json
Creating common.tf.json
python gitlab.tf.json.template.py gitlab.tf.json
Creating gitlab.tf.json
terraform validate
Success! The configuration is valid.

python /Users/daniel/repo/azul1/scripts/rename_resources.py
2023-10-12 01:51:37,959    INFO MainThread __main__: No renamings defined
python /Users/daniel/repo/azul1/scripts/import_default_vpc.py
2023-10-12 01:51:38,334    INFO MainThread __main__: The 'shared' component is not selected, skipping import.
terraform apply
data.google_client_config.current: Reading...
google_project_iam_custom_role.gitlab: Refreshing state... [id=projects/platform-hca-dev/roles/azul_gitlab]
data.google_client_config.current: Read complete after 0s [id=projects/platform-hca-dev/regions//zones/]
google_service_account.gitlab: Refreshing state... [id=projects/platform-hca-dev/serviceAccounts/azul-gitlab@platform-hca-dev.iam.gserviceaccount.com]
data.aws_acm_certificate.gitlab_vpn: Reading...
data.aws_availability_zones.available: Reading...
data.aws_caller_identity.current: Reading...
data.aws_s3_bucket.logs: Reading...
aws_vpc.gitlab: Refreshing state... [id=vpc-03aeb4a3542c7a5d3]
aws_iam_role.gitlab: Refreshing state... [id=azul-gitlab]
aws_key_pair.gitlab: Refreshing state... [id=azul-gitlab]
data.aws_iam_policy_document.gitlab_boundary: Reading...
data.aws_iam_policy_document.gitlab_boundary: Read complete after 0s [id=1363386552]
data.aws_route53_zone.gitlab: Reading...
aws_cloudwatch_log_group.gitlab_vpn: Refreshing state... [id=/aws/vpn/azul-gitlab]
data.aws_caller_identity.current: Read complete after 1s [id=122796619775]
aws_cloudwatch_log_group.gitlab_vpc: Refreshing state... [id=/aws/vpc/azul-gitlab]
data.aws_iam_policy_document.gitlab_iam: Reading...
data.aws_region.current: Reading...
data.aws_region.current: Read complete after 0s [id=us-east-1]
data.aws_ebs_volume.gitlab: Reading...
data.aws_iam_policy_document.gitlab_iam: Read complete after 0s [id=640969318]
data.aws_sns_topic.monitoring: Reading...
data.aws_availability_zones.available: Read complete after 1s [id=us-east-1]
aws_cloudwatch_log_group.gitlab_cwagent: Refreshing state... [id=/aws/cwagent/azul-gitlab]
data.aws_s3_bucket.logs: Read complete after 1s [id=edu-ucsc-gi-platform-hca-dev-logs.us-east-1]
aws_iam_service_linked_role.gitlab_ssm: Refreshing state... [id=arn:aws:iam::122796619775:role/aws-service-role/ssm.amazonaws.com/AWSServiceRoleForAmazonSSM]
data.aws_ebs_volume.gitlab: Read complete after 0s [id=vol-0857f94c30caed5c2]
aws_iam_policy.gitlab_vpc: Refreshing state... [id=arn:aws:iam::122796619775:policy/azul-gitlab_vpc]
aws_iam_role.gitlab_vpc: Refreshing state... [id=azul-gitlab_vpc]
data.aws_acm_certificate.gitlab_vpn: Read complete after 1s [id=arn:aws:acm:us-east-1:122796619775:certificate/39d09a73-bff2-433f-92d7-2e51251f3d11]
aws_iam_policy.gitlab_boundary: Refreshing state... [id=arn:aws:iam::122796619775:policy/azul-boundary]
google_project_iam_member.gitlab_read: Refreshing state... [id=platform-hca-dev/roles/viewer/serviceaccount:azul-gitlab@platform-hca-dev.iam.gserviceaccount.com]
google_project_iam_member.gitlab_write: Refreshing state... [id=platform-hca-dev/projects/platform-hca-dev/roles/azul_gitlab/serviceaccount:azul-gitlab@platform-hca-dev.iam.gserviceaccount.com]
aws_iam_policy.gitlab_iam: Refreshing state... [id=arn:aws:iam::122796619775:policy/azul-gitlab-iam]
data.aws_sns_topic.monitoring: Read complete after 0s [id=arn:aws:sns:us-east-1:122796619775:azul-monitoring-dev]
aws_iam_instance_profile.gitlab: Refreshing state... [id=azul-gitlab]
aws_iam_role_policy_attachment.gitlab_ssm: Refreshing state... [id=azul-gitlab-20230317171412644600000003]
aws_iam_role_policy_attachment.gitlab_ssm_cloudwatch: Refreshing state... [id=azul-gitlab-20230317171412515400000002]
aws_inspector2_enabler.gitlab: Refreshing state... [id=122796619775-EC2:ECR]
aws_cloudwatch_metric_alarm.gitlab_root_disk_use: Refreshing state... [id=azul-gitlab_root_disk_use]
data.aws_route53_zone.gitlab: Read complete after 2s [id=ZRJRXAKW4OYOA]
aws_cloudwatch_metric_alarm.gitlab_data_disk_use: Refreshing state... [id=azul-gitlab_data_disk_use]
aws_cloudwatch_metric_alarm.gitlab_cpu_use: Refreshing state... [id=azul-gitlab_cpu_use]
aws_iam_role_policy_attachment.gitlab_boundary: Refreshing state... [id=azul-gitlab-20200210063300640100000001]
aws_iam_role_policy_attachment.gitlab_iam: Refreshing state... [id=azul-gitlab-20200210062017999700000001]
aws_iam_role_policy_attachment.gitlab_vpc: Refreshing state... [id=azul-gitlab_vpc-20230309220227619800000001]
aws_default_security_group.gitlab: Refreshing state... [id=sg-054d4201850601ad8]
aws_subnet.gitlab_public_0: Refreshing state... [id=subnet-091cfeb398baf4582]
aws_subnet.gitlab_private_0: Refreshing state... [id=subnet-090846270b8070f28]
aws_subnet.gitlab_public_1: Refreshing state... [id=subnet-06a1e10523948ab2a]
aws_internet_gateway.gitlab: Refreshing state... [id=igw-0f4231a8570673a3d]
aws_lb_target_group.gitlab_http: Refreshing state... [id=arn:aws:elasticloadbalancing:us-east-1:122796619775:targetgroup/azul-gitlab-http/136c2d6db59941f6]
aws_security_group.gitlab: Refreshing state... [id=sg-038ac968511f754f0]
aws_security_group.gitlab_vpn: Refreshing state... [id=sg-01b1a7b618593cee2]
aws_flow_log.gitlab: Refreshing state... [id=fl-0cadde7e68610c3c4]
aws_security_group.gitlab_alb: Refreshing state... [id=sg-05c33cf3dc4f1ed59]
aws_lb_target_group.gitlab_ssh: Refreshing state... [id=arn:aws:elasticloadbalancing:us-east-1:122796619775:targetgroup/azul-gitlab-ssh/8826fb86763d46a7]
aws_lb_target_group.gitlab_git: Refreshing state... [id=arn:aws:elasticloadbalancing:us-east-1:122796619775:targetgroup/azul-gitlab-git/8b5c80fd833b73a2]
aws_subnet.gitlab_private_1: Refreshing state... [id=subnet-03e66f953199f819b]
aws_route.gitlab: Refreshing state... [id=r-rtb-0bf39b4e467da13db1080289494]
aws_eip.gitlab_1: Refreshing state... [id=eipalloc-00f90666e313b2664]
aws_eip.gitlab_0: Refreshing state... [id=eipalloc-070d155b557770537]
aws_lb.gitlab_nlb: Refreshing state... [id=arn:aws:elasticloadbalancing:us-east-1:122796619775:loadbalancer/net/azul-gitlab-nlb/4be8c238eee6cc28]
aws_network_interface.gitlab: Refreshing state... [id=eni-0c846b93480f23459]
aws_ec2_client_vpn_endpoint.gitlab: Refreshing state... [id=cvpn-endpoint-0d9d68b02083d5519]
aws_lb.gitlab_alb: Refreshing state... [id=arn:aws:elasticloadbalancing:us-east-1:122796619775:loadbalancer/app/azul-gitlab-alb/c051f98624e68d7e]
aws_nat_gateway.gitlab_0: Refreshing state... [id=nat-03363fac99e2c519d]
aws_nat_gateway.gitlab_1: Refreshing state... [id=nat-065371190014e1037]
aws_ec2_client_vpn_authorization_rule.gitlab: Refreshing state... [id=cvpn-endpoint-0d9d68b02083d5519,172.71.0.0/16]
aws_ec2_client_vpn_network_association.gitlab_1: Refreshing state... [id=cvpn-assoc-00bbe8cefbc7f5041]
aws_ec2_client_vpn_network_association.gitlab_0: Refreshing state... [id=cvpn-assoc-0b8137231a99e9a3b]
aws_route_table.gitlab_0: Refreshing state... [id=rtb-0d32e106d5b44b867]
aws_route_table.gitlab_1: Refreshing state... [id=rtb-03d5e85affa440cbe]
aws_route_table_association.gitlab_0: Refreshing state... [id=rtbassoc-0cca0cb2ca796a414]
aws_route_table_association.gitlab_1: Refreshing state... [id=rtbassoc-0bf5a871dcce50e0e]
aws_route53_record.gitlab_ssh: Refreshing state... [id=ZRJRXAKW4OYOA_ssh.gitlab.dev.singlecell.gi.ucsc.edu_A]
aws_lb_listener.gitlab_git: Refreshing state... [id=arn:aws:elasticloadbalancing:us-east-1:122796619775:listener/net/azul-gitlab-nlb/4be8c238eee6cc28/e3b85edb22ccdac7]
aws_lb_listener.gitlab_ssh: Refreshing state... [id=arn:aws:elasticloadbalancing:us-east-1:122796619775:listener/net/azul-gitlab-nlb/4be8c238eee6cc28/ece81fa484178701]
aws_route53_record.gitlab_docker: Refreshing state... [id=ZRJRXAKW4OYOA_docker.gitlab.dev.singlecell.gi.ucsc.edu_A]
aws_route53_record.gitlab: Refreshing state... [id=ZRJRXAKW4OYOA_gitlab.dev.singlecell.gi.ucsc.edu_A]
aws_instance.gitlab: Refreshing state... [id=i-0ac85c41edd97978f]
aws_acm_certificate.gitlab: Refreshing state... [id=arn:aws:acm:us-east-1:122796619775:certificate/81241b8e-c875-4a22-a30e-58003ee139ae]
aws_lb_listener.gitlab_http: Refreshing state... [id=arn:aws:elasticloadbalancing:us-east-1:122796619775:listener/app/azul-gitlab-alb/c051f98624e68d7e/6ccfdb695c85647e]
aws_route53_record.gitlab_validation["docker.gitlab.dev.singlecell.gi.ucsc.edu"]: Refreshing state... [id=ZRJRXAKW4OYOA__a6c37da0c8e1e6a64de8d3f3a44a582e.docker.gitlab.dev.singlecell.gi.ucsc.edu._CNAME]
aws_route53_record.gitlab_validation["gitlab.dev.singlecell.gi.ucsc.edu"]: Refreshing state... [id=ZRJRXAKW4OYOA__40d5584d9a20d663507b51d30811676f.gitlab.dev.singlecell.gi.ucsc.edu._CNAME]
aws_acm_certificate_validation.gitlab: Refreshing state... [id=2021-12-10 02:03:01.473 +0000 UTC]
aws_lb_target_group_attachment.gitlab_http: Refreshing state... [id=arn:aws:elasticloadbalancing:us-east-1:122796619775:targetgroup/azul-gitlab-http/136c2d6db59941f6-20231012062829452700000002]
aws_lb_target_group_attachment.gitlab_git: Refreshing state... [id=arn:aws:elasticloadbalancing:us-east-1:122796619775:targetgroup/azul-gitlab-git/8b5c80fd833b73a2-20231012062829931500000004]
aws_lb_target_group_attachment.gitlab_ssh: Refreshing state... [id=arn:aws:elasticloadbalancing:us-east-1:122796619775:targetgroup/azul-gitlab-ssh/8826fb86763d46a7-20231012062829693300000003]
aws_volume_attachment.gitlab: Refreshing state... [id=vai-3229068279]

Terraform used the selected providers to generate the following execution plan. Resource actions are indicated with the following symbols:
-/+ destroy and then create replacement

Terraform will perform the following actions:

  # aws_instance.gitlab is tainted, so must be replaced
-/+ resource "aws_instance" "gitlab" {
      ~ arn                                  = "arn:aws:ec2:us-east-1:122796619775:instance/i-0ac85c41edd97978f" -> (known after apply)
      ~ associate_public_ip_address          = false -> (known after apply)
      ~ availability_zone                    = "us-east-1a" -> (known after apply)
      ~ cpu_core_count                       = 2 -> (known after apply)
      ~ cpu_threads_per_core                 = 2 -> (known after apply)
      ~ disable_api_stop                     = false -> (known after apply)
      ~ disable_api_termination              = false -> (known after apply)
      ~ ebs_optimized                        = false -> (known after apply)
      - hibernation                          = false -> null
      + host_id                              = (known after apply)
      + host_resource_group_arn              = (known after apply)
      ~ id                                   = "i-0ac85c41edd97978f" -> (known after apply)
      ~ instance_initiated_shutdown_behavior = "stop" -> (known after apply)
      ~ instance_state                       = "running" -> (known after apply)
      ~ ipv6_address_count                   = 0 -> (known after apply)
      ~ ipv6_addresses                       = [] -> (known after apply)
      ~ monitoring                           = false -> (known after apply)
      + outpost_arn                          = (known after apply)
      + password_data                        = (known after apply)
      + placement_group                      = (known after apply)
      ~ placement_partition_number           = 0 -> (known after apply)
      ~ primary_network_interface_id         = "eni-0c846b93480f23459" -> (known after apply)
      ~ private_dns                          = "ip-172-71-0-215.ec2.internal" -> (known after apply)
      ~ private_ip                           = "172.71.0.215" -> (known after apply)
      + public_dns                           = (known after apply)
      + public_ip                            = (known after apply)
      ~ secondary_private_ips                = [] -> (known after apply)
      ~ security_groups                      = [] -> (known after apply)
      - source_dest_check                    = true -> null
      ~ subnet_id                            = "subnet-090846270b8070f28" -> (known after apply)
        tags                                 = {
            "Name"                = "azul-gitlab"
            "Owner"               = "hannes@ucsc.edu"
            "billing"             = "hca"
            "component"           = "azul-gitlab"
            "deployment"          = "dev"
            "owner"               = "hannes@ucsc.edu"
            "service"             = "azul"
            "terraform_component" = "gitlab"
        }
      ~ tenancy                              = "default" -> (known after apply)
      + user_data_base64                     = (known after apply)
      ~ vpc_security_group_ids               = [
          - "sg-038ac968511f754f0",
        ] -> (known after apply)
        # (8 unchanged attributes hidden)

      ~ capacity_reservation_specification {
          ~ capacity_reservation_preference = "open" -> (known after apply)

          + capacity_reservation_target {
              + capacity_reservation_id                 = (known after apply)
              + capacity_reservation_resource_group_arn = (known after apply)
            }
        }

      - credit_specification {
          - cpu_credits = "unlimited" -> null
        }

      + ebs_block_device {
          + delete_on_termination = (known after apply)
          + device_name           = (known after apply)
          + encrypted             = (known after apply)
          + iops                  = (known after apply)
          + kms_key_id            = (known after apply)
          + snapshot_id           = (known after apply)
          + tags                  = (known after apply)
          + throughput            = (known after apply)
          + volume_id             = (known after apply)
          + volume_size           = (known after apply)
          + volume_type           = (known after apply)
        }
      - ebs_block_device {
          - delete_on_termination = false -> null
          - device_name           = "/dev/sdf" -> null
          - encrypted             = true -> null
          - iops                  = 600 -> null
          - kms_key_id            = "arn:aws:kms:us-east-1:122796619775:key/b43df053-3aff-49a7-8060-589985026613" -> null
          - snapshot_id           = "snap-00fffed9c165f6b37" -> null
          - tags                  = {
              - "Name"  = "azul-gitlab"
              - "owner" = "hannes@ucsc.edu"
            } -> null
          - throughput            = 0 -> null
          - volume_id             = "vol-0857f94c30caed5c2" -> null
          - volume_size           = 200 -> null
          - volume_type           = "gp2" -> null
        }

      ~ enclave_options {
          ~ enabled = false -> (known after apply)
        }

      + ephemeral_block_device {
          + device_name  = (known after apply)
          + no_device    = (known after apply)
          + virtual_name = (known after apply)
        }

      ~ maintenance_options {
          ~ auto_recovery = "default" -> (known after apply)
        }

      ~ metadata_options {
          ~ instance_metadata_tags      = "disabled" -> (known after apply)
            # (3 unchanged attributes hidden)
        }

      ~ private_dns_name_options {
          + enable_resource_name_dns_a_record    = (known after apply)
          + enable_resource_name_dns_aaaa_record = (known after apply)
          + hostname_type                        = (known after apply)
        }

      ~ root_block_device {
          ~ device_name           = "/dev/xvda" -> (known after apply)
          ~ iops                  = 100 -> (known after apply)
          ~ kms_key_id            = "arn:aws:kms:us-east-1:122796619775:key/b43df053-3aff-49a7-8060-589985026613" -> (known after apply)
          - tags                  = {} -> null
          ~ throughput            = 0 -> (known after apply)
          ~ volume_id             = "vol-0420b92be6008e169" -> (known after apply)
          ~ volume_type           = "gp2" -> (known after apply)
            # (3 unchanged attributes hidden)
        }

        # (1 unchanged block hidden)
    }

  # aws_lb_target_group_attachment.gitlab_git must be replaced
-/+ resource "aws_lb_target_group_attachment" "gitlab_git" {
      ~ id               = "arn:aws:elasticloadbalancing:us-east-1:122796619775:targetgroup/azul-gitlab-git/8b5c80fd833b73a2-20231012062829931500000004" -> (known after apply)
      ~ target_id        = "i-0ac85c41edd97978f" -> (known after apply) # forces replacement
        # (1 unchanged attribute hidden)
    }

  # aws_lb_target_group_attachment.gitlab_http must be replaced
-/+ resource "aws_lb_target_group_attachment" "gitlab_http" {
      ~ id               = "arn:aws:elasticloadbalancing:us-east-1:122796619775:targetgroup/azul-gitlab-http/136c2d6db59941f6-20231012062829452700000002" -> (known after apply)
      ~ target_id        = "i-0ac85c41edd97978f" -> (known after apply) # forces replacement
        # (1 unchanged attribute hidden)
    }

  # aws_lb_target_group_attachment.gitlab_ssh must be replaced
-/+ resource "aws_lb_target_group_attachment" "gitlab_ssh" {
      ~ id               = "arn:aws:elasticloadbalancing:us-east-1:122796619775:targetgroup/azul-gitlab-ssh/8826fb86763d46a7-20231012062829693300000003" -> (known after apply)
      ~ target_id        = "i-0ac85c41edd97978f" -> (known after apply) # forces replacement
        # (1 unchanged attribute hidden)
    }

  # aws_volume_attachment.gitlab must be replaced
-/+ resource "aws_volume_attachment" "gitlab" {
      ~ id          = "vai-3229068279" -> (known after apply)
      ~ instance_id = "i-0ac85c41edd97978f" -> (known after apply) # forces replacement
        # (2 unchanged attributes hidden)
    }

Plan: 5 to add, 0 to change, 5 to destroy.

Do you want to perform these actions?
  Terraform will perform the actions described above.
  Only 'yes' will be accepted to approve.

  Enter a value: yes

aws_lb_target_group_attachment.gitlab_git: Destroying... [id=arn:aws:elasticloadbalancing:us-east-1:122796619775:targetgroup/azul-gitlab-git/8b5c80fd833b73a2-20231012062829931500000004]
aws_lb_target_group_attachment.gitlab_ssh: Destroying... [id=arn:aws:elasticloadbalancing:us-east-1:122796619775:targetgroup/azul-gitlab-ssh/8826fb86763d46a7-20231012062829693300000003]
aws_lb_target_group_attachment.gitlab_http: Destroying... [id=arn:aws:elasticloadbalancing:us-east-1:122796619775:targetgroup/azul-gitlab-http/136c2d6db59941f6-20231012062829452700000002]
aws_volume_attachment.gitlab: Destroying... [id=vai-3229068279]
aws_volume_attachment.gitlab: Provisioning with 'local-exec'...
aws_volume_attachment.gitlab (local-exec): Executing: ["/bin/sh" "-c" "aws ec2 stop-instances --instance-ids i-0ac85c41edd97978f && aws ec2 wait instance-stopped --instance-ids i-0ac85c41edd97978f"]
aws_lb_target_group_attachment.gitlab_http: Destruction complete after 1s
aws_lb_target_group_attachment.gitlab_git: Destruction complete after 1s
aws_lb_target_group_attachment.gitlab_ssh: Destruction complete after 1s
aws_volume_attachment.gitlab (local-exec): {
aws_volume_attachment.gitlab (local-exec):     "StoppingInstances": [
aws_volume_attachment.gitlab (local-exec):         {
aws_volume_attachment.gitlab (local-exec):             "CurrentState": {
aws_volume_attachment.gitlab (local-exec):                 "Code": 64,
aws_volume_attachment.gitlab (local-exec):                 "Name": "stopping"
aws_volume_attachment.gitlab (local-exec):             },
aws_volume_attachment.gitlab (local-exec):             "InstanceId": "i-0ac85c41edd97978f",
aws_volume_attachment.gitlab (local-exec):             "PreviousState": {
aws_volume_attachment.gitlab (local-exec):                 "Code": 16,
aws_volume_attachment.gitlab (local-exec):                 "Name": "running"
aws_volume_attachment.gitlab (local-exec):             }
aws_volume_attachment.gitlab (local-exec):         }
aws_volume_attachment.gitlab (local-exec):     ]
aws_volume_attachment.gitlab (local-exec): }
aws_volume_attachment.gitlab: Still destroying... [id=vai-3229068279, 10s elapsed]
aws_volume_attachment.gitlab: Still destroying... [id=vai-3229068279, 20s elapsed]
aws_volume_attachment.gitlab: Still destroying... [id=vai-3229068279, 30s elapsed]
aws_volume_attachment.gitlab: Still destroying... [id=vai-3229068279, 40s elapsed]
aws_volume_attachment.gitlab: Still destroying... [id=vai-3229068279, 50s elapsed]
aws_volume_attachment.gitlab: Still destroying... [id=vai-3229068279, 1m0s elapsed]
aws_volume_attachment.gitlab: Still destroying... [id=vai-3229068279, 1m10s elapsed]
aws_volume_attachment.gitlab: Still destroying... [id=vai-3229068279, 1m20s elapsed]
aws_volume_attachment.gitlab: Still destroying... [id=vai-3229068279, 1m30s elapsed]
aws_volume_attachment.gitlab: Still destroying... [id=vai-3229068279, 1m40s elapsed]
aws_volume_attachment.gitlab: Destruction complete after 1m45s
aws_instance.gitlab: Destroying... [id=i-0ac85c41edd97978f]
aws_instance.gitlab: Still destroying... [id=i-0ac85c41edd97978f, 10s elapsed]
aws_instance.gitlab: Destruction complete after 10s
aws_instance.gitlab: Creating...
aws_instance.gitlab: Still creating... [10s elapsed]
aws_instance.gitlab: Creation complete after 15s [id=i-0c2bf4f03bd842296]
aws_lb_target_group_attachment.gitlab_http: Creating...
aws_volume_attachment.gitlab: Creating...
aws_lb_target_group_attachment.gitlab_git: Creating...
aws_lb_target_group_attachment.gitlab_ssh: Creating...
aws_lb_target_group_attachment.gitlab_git: Creation complete after 1s [id=arn:aws:elasticloadbalancing:us-east-1:122796619775:targetgroup/azul-gitlab-git/8b5c80fd833b73a2-20231012085426921700000002]
aws_lb_target_group_attachment.gitlab_http: Creation complete after 1s [id=arn:aws:elasticloadbalancing:us-east-1:122796619775:targetgroup/azul-gitlab-http/136c2d6db59941f6-20231012085426969100000003]
aws_lb_target_group_attachment.gitlab_ssh: Creation complete after 1s [id=arn:aws:elasticloadbalancing:us-east-1:122796619775:targetgroup/azul-gitlab-ssh/8826fb86763d46a7-20231012085427008100000004]
aws_volume_attachment.gitlab: Still creating... [10s elapsed]
aws_volume_attachment.gitlab: Still creating... [20s elapsed]
aws_volume_attachment.gitlab: Creation complete after 21s [id=vai-488671032]

Apply complete! Resources: 5 added, 0 changed, 5 destroyed.
(.venv) daniel@Crispin ~/repo/azul1 $
```
</details>

# Alarm status after GitLab resource tainted & deployed

![Screen Shot 2023-10-12 at 3 03 56 AM](https://github.com/DataBiosphere/azul/assets/46407464/23087e8a-dc55-4abd-9cf2-ff022093afaa)

No `insufficient_data` alarms were activated during/after the tainting & deploy of GitLab.

They were fired when I reset the deployment by deploying `develop` to `dev.gitlab`.

<details>
<summary>Expand for: Terraform plan when deploying `develop` to reset deployment</summary>

```
Terraform will perform the following actions:

  # aws_cloudwatch_metric_alarm.gitlab_cpu_use will be updated in-place
  ~ resource "aws_cloudwatch_metric_alarm" "gitlab_cpu_use" {
      ~ dimensions                = {
          - "InstanceName" = "azul-gitlab"
        } -> (known after apply)
        id                        = "azul-gitlab_cpu_use"
        tags                      = {
            "Name"                = "azul-gitlab_cpu_use"
            "billing"             = "hca"
            "component"           = "azul-gitlab_cpu_use"
            "deployment"          = "dev"
            "owner"               = "hannes@ucsc.edu"
            "service"             = "azul"
            "terraform_component" = "gitlab"
        }
        # (16 unchanged attributes hidden)
    }

  # aws_cloudwatch_metric_alarm.gitlab_data_disk_use will be updated in-place
  ~ resource "aws_cloudwatch_metric_alarm" "gitlab_data_disk_use" {
      ~ dimensions                = {
          - "InstanceName" = "azul-gitlab"
        } -> (known after apply)
        id                        = "azul-gitlab_data_disk_use"
        tags                      = {
            "Name"                = "azul-gitlab_data_disk_use"
            "billing"             = "hca"
            "component"           = "azul-gitlab_data_disk_use"
            "deployment"          = "dev"
            "owner"               = "hannes@ucsc.edu"
            "service"             = "azul"
            "terraform_component" = "gitlab"
        }
        # (16 unchanged attributes hidden)
    }

  # aws_cloudwatch_metric_alarm.gitlab_root_disk_use will be updated in-place
  ~ resource "aws_cloudwatch_metric_alarm" "gitlab_root_disk_use" {
      ~ dimensions                = {
          - "InstanceName" = "azul-gitlab"
        } -> (known after apply)
        id                        = "azul-gitlab_root_disk_use"
        tags                      = {
            "Name"                = "azul-gitlab_root_disk_use"
            "billing"             = "hca"
            "component"           = "azul-gitlab_root_disk_use"
            "deployment"          = "dev"
            "owner"               = "hannes@ucsc.edu"
            "service"             = "azul"
            "terraform_component" = "gitlab"
        }
        # (16 unchanged attributes hidden)
    }

  # aws_instance.gitlab must be replaced
-/+ resource "aws_instance" "gitlab" {
      ~ arn                                  = "arn:aws:ec2:us-east-1:122796619775:instance/i-0c2bf4f03bd842296" -> (known after apply)
      ~ associate_public_ip_address          = false -> (known after apply)
      ~ availability_zone                    = "us-east-1a" -> (known after apply)
      ~ cpu_core_count                       = 2 -> (known after apply)
      ~ cpu_threads_per_core                 = 2 -> (known after apply)
      ~ disable_api_stop                     = false -> (known after apply)
      ~ disable_api_termination              = false -> (known after apply)
      ~ ebs_optimized                        = false -> (known after apply)
      - hibernation                          = false -> null
      + host_id                              = (known after apply)
      + host_resource_group_arn              = (known after apply)
      ~ id                                   = "i-0c2bf4f03bd842296" -> (known after apply)
      ~ instance_initiated_shutdown_behavior = "stop" -> (known after apply)
      ~ instance_state                       = "running" -> (known after apply)
      ~ ipv6_address_count                   = 0 -> (known after apply)
      ~ ipv6_addresses                       = [] -> (known after apply)
      ~ monitoring                           = false -> (known after apply)
      + outpost_arn                          = (known after apply)
      + password_data                        = (known after apply)
      + placement_group                      = (known after apply)
      ~ placement_partition_number           = 0 -> (known after apply)
      ~ primary_network_interface_id         = "eni-0c846b93480f23459" -> (known after apply)
      ~ private_dns                          = "ip-172-71-0-215.ec2.internal" -> (known after apply)
      ~ private_ip                           = "172.71.0.215" -> (known after apply)
      + public_dns                           = (known after apply)
      + public_ip                            = (known after apply)
      ~ secondary_private_ips                = [] -> (known after apply)
      ~ security_groups                      = [] -> (known after apply)
      - source_dest_check                    = true -> null
      ~ subnet_id                            = "subnet-090846270b8070f28" -> (known after apply)
        tags                                 = {
            "Name"                = "azul-gitlab"
            "Owner"               = "hannes@ucsc.edu"
            "billing"             = "hca"
            "component"           = "azul-gitlab"
            "deployment"          = "dev"
            "owner"               = "hannes@ucsc.edu"
            "service"             = "azul"
            "terraform_component" = "gitlab"
        }
      ~ tenancy                              = "default" -> (known after apply)
      ~ user_data                            = "3b722a2bb45e865ea48b337f77f6310ace6b1ab4" -> "12e76cce0f177d99b425936aff81bd1ac6113158" # forces replacement
      + user_data_base64                     = (known after apply)
      ~ vpc_security_group_ids               = [
          - "sg-038ac968511f754f0",
        ] -> (known after apply)
        # (7 unchanged attributes hidden)

      ~ capacity_reservation_specification {
          ~ capacity_reservation_preference = "open" -> (known after apply)

          + capacity_reservation_target {
              + capacity_reservation_id                 = (known after apply)
              + capacity_reservation_resource_group_arn = (known after apply)
            }
        }

      - credit_specification {
          - cpu_credits = "unlimited" -> null
        }

      + ebs_block_device {
          + delete_on_termination = (known after apply)
          + device_name           = (known after apply)
          + encrypted             = (known after apply)
          + iops                  = (known after apply)
          + kms_key_id            = (known after apply)
          + snapshot_id           = (known after apply)
          + tags                  = (known after apply)
          + throughput            = (known after apply)
          + volume_id             = (known after apply)
          + volume_size           = (known after apply)
          + volume_type           = (known after apply)
        }
      - ebs_block_device {
          - delete_on_termination = false -> null
          - device_name           = "/dev/sdf" -> null
          - encrypted             = true -> null
          - iops                  = 600 -> null
          - kms_key_id            = "arn:aws:kms:us-east-1:122796619775:key/b43df053-3aff-49a7-8060-589985026613" -> null
          - snapshot_id           = "snap-00fffed9c165f6b37" -> null
          - tags                  = {
              - "Name"  = "azul-gitlab"
              - "owner" = "hannes@ucsc.edu"
            } -> null
          - throughput            = 0 -> null
          - volume_id             = "vol-0857f94c30caed5c2" -> null
          - volume_size           = 200 -> null
          - volume_type           = "gp2" -> null
        }

      ~ enclave_options {
          ~ enabled = false -> (known after apply)
        }

      + ephemeral_block_device {
          + device_name  = (known after apply)
          + no_device    = (known after apply)
          + virtual_name = (known after apply)
        }

      ~ maintenance_options {
          ~ auto_recovery = "default" -> (known after apply)
        }

      ~ metadata_options {
          ~ instance_metadata_tags      = "disabled" -> (known after apply)
            # (3 unchanged attributes hidden)
        }

      ~ private_dns_name_options {
          + enable_resource_name_dns_a_record    = (known after apply)
          + enable_resource_name_dns_aaaa_record = (known after apply)
          + hostname_type                        = (known after apply)
        }

      ~ root_block_device {
          ~ device_name           = "/dev/xvda" -> (known after apply)
          ~ iops                  = 100 -> (known after apply)
          ~ kms_key_id            = "arn:aws:kms:us-east-1:122796619775:key/b43df053-3aff-49a7-8060-589985026613" -> (known after apply)
          - tags                  = {} -> null
          ~ throughput            = 0 -> (known after apply)
          ~ volume_id             = "vol-05c2fb6b0d756f6f4" -> (known after apply)
          ~ volume_type           = "gp2" -> (known after apply)
            # (3 unchanged attributes hidden)
        }

        # (1 unchanged block hidden)
    }

  # aws_lb_target_group_attachment.gitlab_git must be replaced
-/+ resource "aws_lb_target_group_attachment" "gitlab_git" {
      ~ id               = "arn:aws:elasticloadbalancing:us-east-1:122796619775:targetgroup/azul-gitlab-git/8b5c80fd833b73a2-20231012085426921700000002" -> (known after apply)
      ~ target_id        = "i-0c2bf4f03bd842296" -> (known after apply) # forces replacement
        # (1 unchanged attribute hidden)
    }

  # aws_lb_target_group_attachment.gitlab_http must be replaced
-/+ resource "aws_lb_target_group_attachment" "gitlab_http" {
      ~ id               = "arn:aws:elasticloadbalancing:us-east-1:122796619775:targetgroup/azul-gitlab-http/136c2d6db59941f6-20231012085426969100000003" -> (known after apply)
      ~ target_id        = "i-0c2bf4f03bd842296" -> (known after apply) # forces replacement
        # (1 unchanged attribute hidden)
    }

  # aws_lb_target_group_attachment.gitlab_ssh must be replaced
-/+ resource "aws_lb_target_group_attachment" "gitlab_ssh" {
      ~ id               = "arn:aws:elasticloadbalancing:us-east-1:122796619775:targetgroup/azul-gitlab-ssh/8826fb86763d46a7-20231012085427008100000004" -> (known after apply)
      ~ target_id        = "i-0c2bf4f03bd842296" -> (known after apply) # forces replacement
        # (1 unchanged attribute hidden)
    }

  # aws_volume_attachment.gitlab must be replaced
-/+ resource "aws_volume_attachment" "gitlab" {
      ~ id          = "vai-488671032" -> (known after apply)
      ~ instance_id = "i-0c2bf4f03bd842296" -> (known after apply) # forces replacement
        # (2 unchanged attributes hidden)
    }

Plan: 5 to add, 3 to change, 5 to destroy.

Do you want to perform these actions?
  Terraform will perform the actions described above.
  Only 'yes' will be accepted to approve.

  Enter a value: yes

aws_volume_attachment.gitlab: Destroying... [id=vai-488671032]
aws_lb_target_group_attachment.gitlab_ssh: Destroying... [id=arn:aws:elasticloadbalancing:us-east-1:122796619775:targetgroup/azul-gitlab-ssh/8826fb86763d46a7-20231012085427008100000004]
aws_lb_target_group_attachment.gitlab_git: Destroying... [id=arn:aws:elasticloadbalancing:us-east-1:122796619775:targetgroup/azul-gitlab-git/8b5c80fd833b73a2-20231012085426921700000002]
aws_lb_target_group_attachment.gitlab_http: Destroying... [id=arn:aws:elasticloadbalancing:us-east-1:122796619775:targetgroup/azul-gitlab-http/136c2d6db59941f6-20231012085426969100000003]
aws_volume_attachment.gitlab: Provisioning with 'local-exec'...
aws_volume_attachment.gitlab (local-exec): Executing: ["/bin/sh" "-c" "aws ec2 stop-instances --instance-ids i-0c2bf4f03bd842296 && aws ec2 wait instance-stopped --instance-ids i-0c2bf4f03bd842296"]
aws_lb_target_group_attachment.gitlab_git: Destruction complete after 1s
aws_lb_target_group_attachment.gitlab_ssh: Destruction complete after 1s
aws_lb_target_group_attachment.gitlab_http: Destruction complete after 1s
aws_volume_attachment.gitlab (local-exec): {
aws_volume_attachment.gitlab (local-exec):     "StoppingInstances": [
aws_volume_attachment.gitlab (local-exec):         {
aws_volume_attachment.gitlab (local-exec):             "CurrentState": {
aws_volume_attachment.gitlab (local-exec):                 "Code": 64,
aws_volume_attachment.gitlab (local-exec):                 "Name": "stopping"
aws_volume_attachment.gitlab (local-exec):             },
aws_volume_attachment.gitlab (local-exec):             "InstanceId": "i-0c2bf4f03bd842296",
aws_volume_attachment.gitlab (local-exec):             "PreviousState": {
aws_volume_attachment.gitlab (local-exec):                 "Code": 16,
aws_volume_attachment.gitlab (local-exec):                 "Name": "running"
aws_volume_attachment.gitlab (local-exec):             }
aws_volume_attachment.gitlab (local-exec):         }
aws_volume_attachment.gitlab (local-exec):     ]
aws_volume_attachment.gitlab (local-exec): }
aws_volume_attachment.gitlab: Still destroying... [id=vai-488671032, 10s elapsed]
aws_volume_attachment.gitlab: Still destroying... [id=vai-488671032, 20s elapsed]
aws_volume_attachment.gitlab: Still destroying... [id=vai-488671032, 30s elapsed]
aws_volume_attachment.gitlab: Still destroying... [id=vai-488671032, 40s elapsed]
aws_volume_attachment.gitlab: Still destroying... [id=vai-488671032, 50s elapsed]
aws_volume_attachment.gitlab: Destruction complete after 1m0s
aws_instance.gitlab: Destroying... [id=i-0c2bf4f03bd842296]
aws_instance.gitlab: Still destroying... [id=i-0c2bf4f03bd842296, 10s elapsed]
aws_instance.gitlab: Destruction complete after 10s
aws_instance.gitlab: Creating...
aws_instance.gitlab: Still creating... [10s elapsed]
aws_instance.gitlab: Creation complete after 15s [id=i-00f40297fd3003172]
aws_lb_target_group_attachment.gitlab_http: Creating...
aws_lb_target_group_attachment.gitlab_ssh: Creating...
aws_lb_target_group_attachment.gitlab_git: Creating...
aws_volume_attachment.gitlab: Creating...
aws_cloudwatch_metric_alarm.gitlab_data_disk_use: Modifying... [id=azul-gitlab_data_disk_use]
aws_cloudwatch_metric_alarm.gitlab_root_disk_use: Modifying... [id=azul-gitlab_root_disk_use]
aws_cloudwatch_metric_alarm.gitlab_cpu_use: Modifying... [id=azul-gitlab_cpu_use]
aws_lb_target_group_attachment.gitlab_http: Creation complete after 0s [id=arn:aws:elasticloadbalancing:us-east-1:122796619775:targetgroup/azul-gitlab-http/136c2d6db59941f6-20231012100538335300000002]
aws_lb_target_group_attachment.gitlab_ssh: Creation complete after 0s [id=arn:aws:elasticloadbalancing:us-east-1:122796619775:targetgroup/azul-gitlab-ssh/8826fb86763d46a7-20231012100538434600000003]
aws_cloudwatch_metric_alarm.gitlab_root_disk_use: Modifications complete after 1s [id=azul-gitlab_root_disk_use]
aws_cloudwatch_metric_alarm.gitlab_data_disk_use: Modifications complete after 1s [id=azul-gitlab_data_disk_use]
aws_cloudwatch_metric_alarm.gitlab_cpu_use: Modifications complete after 1s [id=azul-gitlab_cpu_use]
aws_lb_target_group_attachment.gitlab_git: Creation complete after 1s [id=arn:aws:elasticloadbalancing:us-east-1:122796619775:targetgroup/azul-gitlab-git/8b5c80fd833b73a2-20231012100538824000000004]
aws_volume_attachment.gitlab: Still creating... [10s elapsed]
aws_volume_attachment.gitlab: Still creating... [20s elapsed]
aws_volume_attachment.gitlab: Creation complete after 21s [id=vai-237549001]

Apply complete! Resources: 5 added, 3 changed, 5 destroyed.
```

</summary>